import sqlite3
conn = sqlite3.connect("conf.db")
curs = conn.cursor()
zap1 = ''' CREATE TABLE IF NOT EXISTS "Конференции"("Название коференции" TEXT,"Дата проведения" TEXT, "Место проведения" TEXT, "Организаторы" TEXT, "Спонсоры" TEXT,  
"Количество дней проведения конференции" TEXT, "Количество участников" TEXT, "Количество докладчиков" TEXT);'''
zap2 = ''' CREATE TABLE IF NOT EXISTS "Cправочник персоналий участников конференции"("ФИО" TEXT, "ученая степень" TEXT, "научное направление" TEXT, 
"место работы" TEXT, "кафедра" TEXT, "должность" TEXT, "страна" TEXT, "город" TEXT, "адрес" TEXT, "рабочий телефон" TEXT, "адрес электронной почты" TEXT);'''
zap3 = ''' CREATE TABLE IF NOT EXISTS "Информация, связанная с участием в конференции"("Докладчик или участник" TEXT, "дата рассылки приглашения" TEXT,
 "дата поступления заявки" TEXT, "тема доклада" TEXT, "отметка о поступлении тезисов" TEXT, "дата приезда" TEXT, "потребность в гостинице" TEXT, "дата отъезда" TEXT);'''
uchast1 = ["Смирнов Сергей Петрович", "Магистр", "Математика", "БНТУ", "Высшая математика", "Преподаватель", "Беларусь" , "Минск", "Независимости,65" ,
           "80295436574", "аааа@mail.ru"]
uchast2 = ["Иванов Иван Васильевич", "Магистр", "Математика", "БГТУ", "Высшая математика", "Преподаватель", "Беларусь" , "Минск", "Свердлова,13" ,
           "80298474903", "bgbgbh@mail.ru"]
uchast3 = ["Калугин Олег Викторович", "Кандидат наук", "Прикладная информатика", "БГУиР", "Информационные технологии", "Преподаватель", "Беларусь" ,
           "Минск", "П.Бровки, 6" , "80297489403", "hikol@mail.ru"]
uchast4 = ["Харитончик Виктор Олегович", "Кандидат наук", "Физика", "МТУСИ", "Физика", "Преподаватель", "Российская Федерация" ,
           "Москва", "Авангардная,5" , "+74232497777", "sdjfk@mail.ru"]
uchast5 = ["Иванов Артём Петрович", "Магистр", "Математика", "БНТУ", "Высшая математика", "Преподаватель", "Беларусь" , "Минск", "Независимости,65" ,
           "80293608453", "qwfdfo@mail.ru"]
uchast6 = ["Гарновский Вячеслав Викторович", "Доктор наук", "Физика", "БГУиР", "Физика", "Преподаватель", "Беларусь" , "Минск", "П.Бровки, 6" ,
           "80291234567", "kshdfjh@mail.ru"]
zap4 = """INSERT INTO "Cправочник персоналий участников конференции" VALUES (?,?,?,?,?,?,?,?,?,?,?);"""
curs.execute(zap1)
conf1 = ["Роль высшей математики в современном мире","13.10.2022", "Минск,пр.Независимости,65" , "Гарновский В.В.", "Карпук Н.В.",
"2", "3", "3" ]
conf2 = ["Физика веществ","08.09.2022", "Минск,пр.Независимости,65", "Кравчук А.В.", "Карпук Н.В.",
"3", "6", "6"]
conf3 = ["Информационные технологии в повседневной жизни","18.09.2022", "Минск,пр.Независимости,65", "Василюк А.В.", "Карпук Н.В.",
"3", "6", "6"]
conf4 = ["Новейшие открытия в сфере электричества","08.06.2022", "Минск,пр.Независимости,65", "Шахлевич А.П.", "Карпук Н.В.",
"1", "5", "5"]
conf5 = ["Ядерная физика","11.05.2022", "Минск,пр.Независимости,65", "Гарновский В.В., Трубинова А.С.", "Карпук Н.В.",
"2", "3", "5"]
conf6 = ["Информационные технологии в дошкольное время","08.03.2022", "Минск,пр.Независимости,65", "Кравчук А.В.", "Карпук Н.В.",
"1", "3", "6"]
zap5 = """INSERT INTO "Конференции" VALUES(?,?,?,?,?,?,?,?)"""
curs.execute(zap2)
zap6 = """INSERT INTO "Информация, связанная с участием в конференции" VALUES(?,?,?,?,?,?,?,?)"""
inf1 = ["Смирнов С.П.", "15.02.2022",
 "25.02.2022", "Математика в ИТ", "+", "16.09.2022", "+", "20.09.2022" ]
inf2 = ["Иванов И.В.", "15.02.2022",
 "25.02.2022", "Математика в физике на сегодняшний день", "+", "16.09.2022", "-", "21.09.2022"]
inf3 = ["Калугин О.В.", "15.02.2022",
 "25.02.2022", "ИТ в повседневной жизни", "+", "16.09.2022", "+", "22.09.2022"]
inf4 = ["Харитончик В.О.", "15.02.2022",
 "25.02.2022", "Ядерная физика в повседневной жизни", "+", "09.05.2022", "+", "15.05.2022"]
inf5 = ["Иванов А.П.", "15.02.2022",
 "25.02.2022", "Вышмат в ИТ", "+", "01.10.2022", "+", "7.10.2022"]
inf6 = ["Гарновский В.В.", "15.02.2022",
 "25.02.2022", "Новейшие открытия в сфере электричества", "+", "06.06.2022", "+", "12.06.2022"]
curs.execute(zap3)
curs.execute(zap4,uchast1)
curs.execute(zap4,uchast2)
curs.execute(zap4,uchast3)
curs.execute(zap4,uchast4)
curs.execute(zap4,uchast5)
curs.execute(zap4,uchast6)
curs.execute(zap5,conf1)
curs.execute(zap5,conf2)
curs.execute(zap5,conf3)
curs.execute(zap5,conf4)
curs.execute(zap5,conf5)
curs.execute(zap5,conf6)
curs.execute(zap6,inf1)
curs.execute(zap6,inf2)
curs.execute(zap6,inf3)
curs.execute(zap6,inf4)
curs.execute(zap6,inf5)
curs.execute(zap6,inf6)
conn.commit()
curs.close()
conn.close()
